In [1]:
import pandas as pd 
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare  ...  class    who adult_male  deck  embark_town alive  alone
0         0       3    male  22.0      1      0   7.2500  ...  Third    man       True   NaN  Southampton    no  False
1         1       1  female  38.0      1      0  71.2833  ...  First  woman      False     C    Cherbourg   yes  False
2         1       3  female  26.0      0      0   7.9250  ...  Third  woman      False   NaN  Southampton   yes   True
3         1       1  female  35.0      1      0  53.1000  ...  First  woman      False     C  Southampton   yes  False
4         0       3    male  35.0      0      0   8.0500  ...  Third    man       True   NaN  Southampton    no   True

[5 rows x 15 columns]

In [25]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean") # cinsiyet ve sinifa gore gruplamis oldu ve hayata kalanlarin tablosunu istedik.
                                                                            # aggregate ile survived in ortalamasini aldik.

C:\Users\Alperen Arda\AppData\Local\Temp\ipykernel_29532\3153727460.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean") # cinsiyet ve sinifa gore gruplamis oldu ve hayata kalanlarin tablosunu istedik.

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [26]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()

C:\Users\Alperen Arda\AppData\Local\Temp\ipykernel_29532\3680809584.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [31]:
# pivot ile pivot table
# Pivot table, verileri özet tablo halinde görselleştirmek için kullanılan bir yöntemdir.

In [32]:
titanic.pivot_table("survived", index="sex", columns="class", observed=False)
#                   odaklanilan degisken / index / index2

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [34]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [38]:
age = pd.cut(titanic["age"], [0, 18, 98])
age.head(10)
# cut degiskeni ile surekli bir degiskeni kategorik degiskene donusturmus olduk

0    (18.0, 98.0]
1    (18.0, 98.0]
2    (18.0, 98.0]
3    (18.0, 98.0]
4    (18.0, 98.0]
5             NaN
6    (18.0, 98.0]
7     (0.0, 18.0]
8    (18.0, 98.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 98]]

In [42]:
titanic.pivot_table("survived", ["sex", age], "class") # boylelikle 4. degiskeni eklemis olduk.

C:\Users\Alperen Arda\AppData\Local\Temp\ipykernel_29532\3708674916.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table("survived", ["sex", age], "class") # boylelikle 4. degiskeni eklemis olduk.

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 98]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 98]  0.375000  0.071429  0.133663